results/actix_light_20251009_071302/wrk_output.txt
Running 1m test @ http://127.0.0.1:8080/hello
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.69ms  129.61ms   1.37s    97.52%
    Req/Sec    40.93k     7.80k   59.78k    68.93%
  Latency Distribution
     50%  346.00us
     75%  807.00us
     90%    2.41ms
     99%  871.92ms
  9804333 requests in 1.05m, 2.10GB read
Requests/sec: 156313.86
Transfer/sec:     34.29MB